#Область ОбработчикиСобытий   

#Область СписокЗаказов

// Возвращает список заказов 
// (Обработчик метода GET /v1/order/list)
// 
// Коды ответов:                     
//  200 - запрос выполнен.
//  500 - внутренняя ошибка.
//
Функция СписокЗаказовGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СписокЗаказов = УправлениеЗаказами.СписокЗаказов();	
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область ЗаказПоИдентификатору

// Возвращает заказ по идентификатору
// (Обработчик метода GET /v1/order/{id})
// 
// Параметры:
// 	id - Строка - идентификатор заказа
//
// Коды ответов:                     
//  200 - запрос выполнен.
//	404 - заказ по идентификатору не найден.
//  500 - внутренняя ошибка.
//
Функция ЗаказПоИдентификаторуGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Заказ = УправлениеЗаказами.ЗаказПоИдентификатору(Запрос["ПараметрыURL"].Получить("id"));
	Возврат Ответ;
КонецФункции

// Изменяет заказ по идентификатору
// (Обработчик метода PUT /v1/order/{id})
// 
// Параметры:
// 	id - Строка - идентификатор заказа
//
// Коды ответов:                     
//  200 - запрос выполнен.
//	404 - заказ по идентификатору не найден.
//  500 - внутренняя ошибка.
//
Функция ЗаказПоИдентификаторуPUT(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ВходящиеПараметры = Новый Структура;
	УправлениеЗаказами.ОбновитьЗаказПоИдентификатору(
		Запрос["ПараметрыURL"].Получить("id"), 
		ВходящиеПараметры);
	Возврат Ответ;
КонецФункции

// Удаляет заказ по идентификатору
// (Обработчик метода DELETE /v1/order/{id})
// 
// Параметры:
// 	id - Строка - идентификатор заказа
//
// Коды ответов:                     
//  200 - запрос выполнен.
//	404 - заказ по идентификатору не найден.
//  500 - внутренняя ошибка.
//
Функция ЗаказПоИдентификаторуDELETE(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	УправлениеЗаказами.УдалитьЗаказПоИдентификатору(Запрос["ПараметрыURL"].Получить("id"));
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область Заказ

// Создает заказ на основе входящих данных
// (Обработчик метода POST /v1/order)
//
// Коды ответов:                     
//  200 - запрос выполнен.
//  500 - внутренняя ошибка.
//
Функция ЗаказPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ВходящиеПараметры = Новый Структура;
	Заказ = УправлениеЗаказами.НовыйЗаказПоВходящиеПараметрам(ВходящиеПараметры);
	Возврат Ответ;
КонецФункции

#КонецОбласти

#КонецОбласти