#Область ПрограммныйИнтерфейс      

// СписокЗаказов 
//		Возвращает список актуальных заказов в учетной системе
//
// Параметры:
//	УчитыватьЗакрытыеЗаказы - Булево - включить в выборку закрытые заказы 
//
// Возвращаемое значение:
// 	Массив - список заказов в массиве 
//
Функция СписокЗаказов(УчитыватьЗакрытыеЗаказы = Ложь) Экспорт
	
	Коллекция = Новый Массив;

	Заказ = Новый Структура;
	Заказ.Вставить("Идентификатор", "1");
	Коллекция.Добавить(Заказ);
	
	Возврат Коллекция;
	
КонецФункции

// ЗаказПоИдентификатору
//		Возвращает заказ по идентификатору
//
// Параметры:
//	Идентификатор - Строка - идентификатор заказа 
//
// Возвращаемое значение:
// 	Структура, Неопределено - структура со свойствами заказа. Если заказ не найден - возвращает неопределено. 
//
Функция ЗаказПоИдентификатору(Идентификатор) Экспорт
	
	Возврат Новый Структура("Идентификатор", Идентификатор);
	
КонецФункции

// ОбновитьЗаказПоИдентификатору
//		Обновляет заказ по идентификатору и возвращает его текущее состояние
//
// Параметры:
//  Идентификатор - Строка - идентификатор заказа 
//  ВходящиеПараметры - Структура - параметры заказа для изменения
// 
// Возвращаемое значение:
//  Структура - заказ в виде структуры. Если заказ то возвращает неопределено.  
//
Функция ОбновитьЗаказПоИдентификатору(Идентификатор, ВходящиеПараметры) Экспорт
	
	Возврат Новый Структура("Идентификатор", Идентификатор);
	
КонецФункции


// УдалитьЗаказПоИдентификатору
//		Удаляет заказ по идентификатору
//
// Параметры:
//  Идентификатор - Строка - идентификатор заказа
// 
// Возвращаемое значение:
// 	Булево - результат удаления. В случае успеха возвращает Истина. 
//
Функция УдалитьЗаказПоИдентификатору(Идентификатор) Экспорт
	
	Возврат Истина;	
	
КонецФункции

// НовыйЗаказПоВходящиеПараметрам
//		Создает новый заказ на основании входящие параметров
//
// Параметры:
//  ВходящиеПараметры - Структура - параметры заказа для создания 
// 
// Возвращаемое значение:
// 	Стурктура, Неопределено - заказ в виде структуры. Если заказ не создан возвращает неопределено.
//
Функция НовыйЗаказПоВходящиеПараметрам(ВходящиеПараметры) Экспорт
	Возврат Новый Структура("Идентификатор", "1");	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти